# 2-8. Число 8: напишите операции сложения, вычитания, умножения и деления, 
# результатом которых является число 8. Не забудьте заключить операции в команды print, 
# чтобы проверить результат. Вы должны написать четыре строки кода, которые выглядят примерно так:
# print(5 + 3). Результатом должны быть четыре строки, в каждой из которых выводится число 8.
print(1111 - 1103)
print(0 + 8)
print(2 * 4)
print(8 // 1)

# 2-9. Любимое число: сохраните свое любимое число в переменной. 
# Затем при помощи переменной создайте сообщение для вывода этого числа. Выведите это сообщение.
favoutite_num = 5
message = 'My favourite number is ' + str(favoutite_num)
print(message)